OpenFOAM/probe_out_k_epsilon/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform 0; // need to define pressure at whichever inlet/outlet isn't defined in velocity 
    }
    inlet
    {
        type            zeroGradient; 
    }
    wall
    {
        type            zeroGradient;
    }
    probe
    {
        type            zeroGradient;
    }
}
